package org.esadev.mastermindhelper.service;

import java.time.LocalDate;
import java.util.HashMap;
import java.util.HashSet;
import java.util.Map;
import java.util.Set;
import java.util.concurrent.ThreadLocalRandom;
import org.springframework.stereotype.Service;

@Service
public class DailyTaskService {

  private static final Map<Integer, String> DAILY_TASKS = new HashMap<>();
  private final Set<Integer> usedTasks = new HashSet<>();


  public DailyTaskService() {
    DAILY_TASKS.put(0,
        "Розкажіть про маловідомий технічний інструмент або ресурс, який допоміг вам у роботі. Заохочуйте інших спробувати його теж та поділитися враженнями.");
    DAILY_TASKS.put(1,
        "Візьміть 5 хвилин для медитації або практики уваги. Можна використовувати додатки, наприклад, Headspace чи Calm, якщо потрібно.");
    DAILY_TASKS.put(2, "Складіть список трьох речей, які ви хочете досягти у своїй кар'єрі протягом наступних 5 років.");
    DAILY_TASKS.put(3, "Запропонуйте іншим навчити навичкам, в яких ви сильні, та попросіть навчити вас чогось нового.");
    DAILY_TASKS.put(4, "Запишіть три речі, за які ви вдячні у своєму житті або кар'єрному зростанні.");
    DAILY_TASKS.put(5,
        "Зверніться до когось у своїй мережі, з ким давно не спілкувалися. Поділіться цікавою статтею або просто поговоріть.");
    DAILY_TASKS.put(6, "Пройдіться до звичного вам місця (магазину, офісу, кав'ярні) новим маршрутом. Звертайте увагу на речі навколо.)");
    DAILY_TASKS.put(7, "Проведіть 10 хвилин, записуючи якнайбільше ідей для потенційного проекту.");
    DAILY_TASKS.put(8, "Послухайте подкаст, що не стосується кар'єри, поділіться з рештою, якщо вам сподобався випуск");
    DAILY_TASKS.put(9,
        "Проведіть годину без будь-яких технологічних відволікаючих чинників — ні телефонів, ноутбуків чи планшетів. Використайте цей час для рефлексії, читання або хоббі.");
    DAILY_TASKS.put(10, "Вийдіть на 15-хвилинну прогулянку прям посеред робочого дня і просто подихайте свіжим повітрям");
    DAILY_TASKS.put(11, "Виконайте 5-хвилинну йогу за робочим столом для розтягнення і розслаблення м'язів.");
    DAILY_TASKS.put(12,
        "Поділіться загадкою або головоломкою з групою. Перша особа, яка її вирішить, отримає +10% до свого тижневого прогресу по цілям цілям \uD83D\uDE03!");
    DAILY_TASKS.put(14,
        "Сьогодні - групове завдання! Зробіть всі разом міні-фітнес-завдання, наприклад, 50 присідань або утримання планки протягом 1 хв. Спорт - це сила!");
    DAILY_TASKS.put(15, "Поділіться швидким, здоровим рецептом, який забезпечує вас енергією під час напружених робочих днів.");
    DAILY_TASKS.put(16, "Поділіться піснею, яка мотивує чи надихає вас у вашому житті чи кар'єрі.");
    DAILY_TASKS.put(17,
        "Для створення нових нейронних зв'язків, інколи потрібно трохи 'поламати' свій мозок. Сьогодні цілий день виконуй звичні завдання лівою рукою (або правою, якщо ти лівша).");
    DAILY_TASKS.put(18, "Порекомендуйте книгу або статтю, яка стосується особистого росту чи розвитку кар'єри.");
    DAILY_TASKS.put(19,
        "Поділіться порадою чи активністю DIY для зняття стресу, яка працює для вас. Наприклад, створення заспокійливого ароматичного масла чи стресового м'ячика.");
    DAILY_TASKS.put(20, "Випийте принаймні 1 літр води протягом дня. Киньте пруф у чат!");
    DAILY_TASKS.put(21, "Випийту склянку апельсинового фрешу на сніданок");
    DAILY_TASKS.put(22,
        "Виділіть декілька хвилин, щоб налаштувати своє робоче місце для кращої ергономіки. Поділіться порадами щодо комфортного організації робочого місця.");
    DAILY_TASKS.put(23, "Відведіть 15 хвилин на глибоке дихання для розслаблення і фокусування розуму.");
    DAILY_TASKS.put(24,
        "Пообіцяйте собі після 20:00 не користуватися телефоном, ноутбуком або телевізором для відпочинку очей та покращення якості сну.");
    DAILY_TASKS.put(25,
        "Проведіть коротку прогулянку, фокусуючись на речах, за які ви вдячні у своєму житті чи кар'єрі. Поділіться однією річчю, яку ви згадали під час прогулянки.");
    DAILY_TASKS.put(26,
        "Проведіть обід без будь-яких технологічних відволікаючих чинників — ні телефонів, ноутбуків чи телевізорів. Сконцентруйтеся на смаку їжі та більше уваги моменту.");
  }

  public String choose() {
    Integer randIndx = ThreadLocalRandom.current().nextInt(DAILY_TASKS.size());
    while (usedTasks.contains(randIndx)) {
      randIndx = ThreadLocalRandom.current().nextInt(DAILY_TASKS.size());
    }
    if (LocalDate.now().equals(LocalDate.of(2023, 12, 31))) {
      return "Вітаю, останнє завдання! Ти провів потужний рік, тому на сьогодні головне завдання - відпочити і набратися сил на наступний рік!";
    }

    usedTasks.add(randIndx);
    return DAILY_TASKS.get(randIndx);
  }

  public String startOfSurprise() {
    return """
        Зараз всі шаленіють від всіляких адвент-календарів, тож у нас теж має бути свій, але, звісно, діджитал-календар!
        Кожного дня ви будете отримувати нове завдання, яке допоможе вам розвиватися, перевірити себе на стійкість або просто розслабитися.
        Тож Рушєймо!!!
        """;
  }
}
